<?php
/**
 * +----------------------------------------------------------------------
 * |
 * +----------------------------------------------------------------------
 * | Author: lidong <947714443@qq.com>
 * +----------------------------------------------------------------------
 * | Date 2019/9/20 0020
 * +----------------------------------------------------------------------
 * | File Describe:
 */
return [
    'devices' => [
        /* 允许的设备类型 */
        'web', /* PC 端 web */
        'android', /* 安卓端 */
        'iphone', /* iphone 端 */
        'ipad', /* ipad 端 */
        'wap', /* 移动 wap 端 */
        'wxapp', /* 微信小程序端 */
    ],
    'images'  => [
        /* 允许的图片类型 */
        'png',
        'jpg',
        'jpeg',
        'gif',
    ],
    'files'   => [
        /* 允许的文件类型 */
        'zip',
        'rar',
        '7z',
        'tar',
        'gz',
    ],
    'video'   => [
        /* 允许的视频类型 */
        'mp4',
        'ogg',
        'webm',
    ],
    'audio'   => [
        /* 允许的音频类型 */
        'wav',
        'mp3',
        'ogg',
        'acc',
        'webm',
    ],
];